Revit 2027 API
DirectShapeType.AppendShape Method
Overload List
Name | Description
AppendShape(IList<GeometryObject>) |  Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
AppendShape(ShapeBuilder) |  Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShapeType. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShapeType. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace